In [1]:
import pandas as pd
df_student = pd.read_csv('bks_xsjbsjxx_out.csv')

# 1. 各个表的信息

## 1.1 学生数据基本信息
1. 学生数据为32480条
2. 出生地码(csdm) 籍贯(jg)国籍地区码(gjdqm) 港澳台侨外码(gatqwm) 健康状态码(jkzkm) 是否留学生(sflxs) 是否独生子女(sfdszn) 等数据缺失严重 基本大于32470 若后续不相关则去掉，若相关则取默认值或平均值
3. 出生日期(csrq)部分缺失，可以考虑转化成年龄
4. 民族码(mzm) 部分缺失，考虑取中位数
5. 政治面貌码(zzmmm)部分缺失，考虑取中位数

In [2]:
df_student.isnull().sum()

xh            0
xm            0
xb            0
csrq        494
csdm      32474
jg        32480
mzm        1970
gjdqm     32471
gatqwm    32475
zzmmm      2519
jkzkm     32472
xyzjm     32474
sflxs     32472
sfdszn    32471
dtype: int64

In [3]:
student_sfdszn = df_student[df_student['sfdszn'].notnull()]

In [4]:
student_sflxs = df_student[df_student['sflxs'].notnull()]

*是否留学生数据缺失严重，而且有数据的均为0，暂且认定为不是留学生，考虑去掉该属性*

In [5]:
student_jkzkm = df_student[df_student['jkzkm'].notnull()]

*健康状况码缺失严重，有数据时均为1，默认全为健康，考虑去掉该属性*

In [6]:
student_gatqwm = df_student[df_student['gatqwm'].notnull()]

*港澳台侨外数据缺失严重，均为0，考虑去掉*

In [7]:
student_gjdqm = df_student[df_student['gjdqm'].notnull()]

*国籍地区码考虑去掉*

*籍贯全缺失，去掉该属性*

*出生地码考虑去掉*

In [8]:
student_csrq = df_student[df_student['csrq'].isnull()]
df_student['csrq'].isnull().sum()

494

*将出生日期转换成年龄，然后用相同入学年份的中位数填补缺失值*

In [9]:
student_mzm = df_student[df_student['mzm'].isnull()]
df_student['mzm'].isnull().sum()

1970

In [10]:
student_mzm.sample(5)

,xh,xm,xb,csrq,csdm,jg,mzm,gjdqm,gatqwm,zzmmm,jkzkm,xyzjm,sflxs,sfdszn
27697,201713030,贾*晴,女,1999-09,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
28642,201762088,杜*,男,2000-02,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
18272,201509062,宋*义,男,1997-03,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
23135,201742069,苏*瑶,女,1999-08,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
27871,201742098,邓*凌,男,2000-07,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [11]:
df = df_student[df_student['mzm'].notnull()].drop_duplicates(subset=['mzm'],keep='first')

*民族码根据相同年份入学的民族的中位数填补*

In [12]:
student_zzmmm = df_student[df_student['zzmmm'].isnull()]
df_student['zzmmm'].isnull().sum()

2519

In [13]:
df_zzmmm = df_student[df_student['zzmmm'].notnull()].drop_duplicates(subset=['zzmmm'],keep='first')
df_zzmmm

,xh,xm,xb,csrq,csdm,jg,mzm,gjdqm,gatqwm,zzmmm,jkzkm,xyzjm,sflxs,sfdszn
0,201519324,张*蔚,男,1997-05,NaN,NaN,11.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
18,201532448,李*峰,男,1997-01,NaN,NaN,1.0,NaN,NaN,13.0,NaN,NaN,NaN,NaN
368,201540050,冀*琦,男,1994-06,NaN,NaN,1.0,NaN,NaN,1.0,NaN,NaN,NaN,NaN
1121,201403002,吴*,女,1996-08,NaN,NaN,1.0,NaN,NaN,2.0,NaN,NaN,NaN,NaN

*zzmmm按相同入学年份中位数进行填补*

In [14]:
df_student.sample(5)

,xh,xm,xb,csrq,csdm,jg,mzm,gjdqm,gatqwm,zzmmm,jkzkm,xyzjm,sflxs,sfdszn
17587,201420109,刘*奕,女,1996-12,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
6828,201569036,管*博,男,1995-11,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
31910,201449421,邱*,男,1996-09,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
12283,201820033,张*阳,女,2000-08,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
12032,201514140,张*强,男,1998-04,NaN,NaN,1.0,NaN,NaN,13.0,NaN,NaN,NaN,NaN

In [15]:
df_student.describe()

,xh,csdm,jg,mzm,gjdqm,gatqwm,zzmmm,jkzkm,xyzjm,sflxs,sfdszn
count,3.248000e+04,6.000000,0.0,30510.000000,9.0,5.0,29961.000000,8.0,6.0,8.0,9.000000
mean,2.016610e+08,367343.500000,NaN,2.085841,156.0,0.0,3.270418,1.0,0.0,0.0,0.666667
std,4.432228e+06,199292.481756,NaN,3.922360,0.0,0.0,1.629963,0.0,0.0,0.0,0.500000
min,2.014000e+08,150400.000000,NaN,1.000000,156.0,0.0,1.000000,1.0,0.0,0.0,0.000000
25%,2.015150e+08,210720.500000,NaN,1.000000,156.0,0.0,3.000000,1.0,0.0,0.0,0.000000
50%,2.016321e+08,355509.500000,NaN,1.000000,156.0,0.0,3.000000,1.0,0.0,0.0,1.000000
75%,2.017541e+08,508775.000000,NaN,1.000000,156.0,0.0,3.000000,1.0,0.0,0.0,1.000000
max,1.000000e+09,620321.000000,NaN,60.000000,156.0,0.0,13.000000,1.0,0.0,0.0,1.000000

# 2. 数据清洗

## 2.1 学生信息

### 2.1.1 删除学生信息严重缺失的属性

In [20]:
df_student.sample(5)

,xh,xm,xb,csrq,csdm,jg,mzm,gjdqm,gatqwm,zzmmm,jkzkm,xyzjm,sflxs,sfdszn
23297,201712088,赵*奇,男,1999-05,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16920,201709325,孙*宇,男,1999-09,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
15931,201797016,于*康,男,1999-06,NaN,NaN,11.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
18583,201778050,刘*鑫,男,1999-11,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN
378,201592042,朱*峰,男,1997-07,NaN,NaN,1.0,NaN,NaN,3.0,NaN,NaN,NaN,NaN

In [21]:
df_student.dropna(axis=1, thresh=10,inplace=True)
df_student.head(5)

          xh   xm xb     csrq   mzm  zzmmm
0  201519324  张*蔚  男  1997-05  11.0    3.0
1  201507048   徐*  女  1999-09   1.0    3.0
2  201587017  张*农  男  1997-06   1.0    3.0
3  201588010   李*  女  1997-08   1.0    3.0
4  201508021  董*翔  男  1997-08   1.0    3.0

### 2.1.2 将出生日期转换成年龄

In [22]:
import datetime as dt
now_year = dt.datetime.today().year
now_year

2019

In [23]:
now_month = dt.datetime.today().month
now_month

5

In [24]:
df_student['csrq'] = pd.to_datetime(df_student['csrq'])
df_student.head(5)

          xh   xm xb       csrq   mzm  zzmmm
0  201519324  张*蔚  男 1997-05-01  11.0    3.0
1  201507048   徐*  女 1999-09-01   1.0    3.0
2  201587017  张*农  男 1997-06-01   1.0    3.0
3  201588010   李*  女 1997-08-01   1.0    3.0
4  201508021  董*翔  男 1997-08-01   1.0    3.0

In [25]:
df_student['age'] = now_year - df_student.csrq.dt.year
df_student.head(5)

          xh   xm xb       csrq   mzm  zzmmm   age
0  201519324  张*蔚  男 1997-05-01  11.0    3.0  22.0
1  201507048   徐*  女 1999-09-01   1.0    3.0  20.0
2  201587017  张*农  男 1997-06-01   1.0    3.0  22.0
3  201588010   李*  女 1997-08-01   1.0    3.0  22.0
4  201508021  董*翔  男 1997-08-01   1.0    3.0  22.0

In [26]:
df_student.drop(columns='csrq',inplace=True)

In [27]:
df_student.sample(5)

              xh   xm xb  mzm  zzmmm   age
20901  201629052  张*博  男  1.0    3.0  22.0
29480  201729141  王*蕾  女  1.0    3.0  21.0
5083   201596043   郭*  男  1.0    3.0  22.0
1289   201559321  杨*鸣  女  1.0    3.0  22.0
24292  201749049  杨*君  女  1.0    3.0  19.0

In [28]:
df_student.isnull().sum()

xh          0
xm          0
xb          0
mzm      1970
zzmmm    2519
age       494
dtype: int64

### 2.1.3 用相同入学年份的同学年龄、民族码、政治面貌码的中位数填补缺失数据

In [29]:
student_2014 = df_student.loc[df_student['xh'].isin(range(201400000,201500000))]
student_2014.describe()
student_2014.isnull().sum()

xh         0
xm         0
xb         0
mzm       98
zzmmm    354
age      112
dtype: int64

In [30]:
student_2015 = df_student.loc[df_student['xh'].isin(range(201500000,201600000))]
student_2015.describe()
student_2015.isnull().sum()

xh         0
xm         0
xb         0
mzm      158
zzmmm    417
age      136
dtype: int64

In [31]:
student_2016 = df_student.loc[df_student['xh'].isin(range(201600000,201700000))]
student_2016.describe()
student_2016.isnull().sum()

xh         0
xm         0
xb         0
mzm      174
zzmmm    207
age      115
dtype: int64

In [32]:
student_2017 = df_student.loc[df_student['xh'].isin(range(201700000,201800000))]
student_2017.describe()
student_2017.isnull().sum()

xh          0
xm          0
xb          0
mzm      1445
zzmmm    1454
age        93
dtype: int64

In [33]:
student_2018 = df_student.loc[df_student['xh'].isin(range(201800000,201900000))]
student_2018.describe()
student_2018.isnull().sum()

xh        0
xm        0
xb        0
mzm      94
zzmmm    86
age      37
dtype: int64

In [34]:
student_sum = len(student_2014)+len(student_2015)+len(student_2016)+len(student_2017)+len(student_2018)
student_sum

32479

In [35]:
len(df_student)

32480

In [36]:
df_student.isnull().sum()

xh          0
xm          0
xb          0
mzm      1970
zzmmm    2519
age       494
dtype: int64

In [37]:
df_student.loc[df_student['xh'].isin([999999999])]

              xh  xm xb  mzm  zzmmm  age
31741  999999999  王*  男  NaN    NaN  NaN

**学号为99999999**

In [38]:
age_2014 = student_2014['age'].median()
age_2014

23.0

In [39]:
age_2015 = student_2015['age'].median()
age_2015

22.0

In [40]:
age_2016 = student_2016['age'].median()
age_2016

21.0

In [41]:
age_2017 = student_2017['age'].median()
age_2017

20.0

In [42]:
age_2018 = student_2018['age'].median()
age_2018

19.0

**填补缺失年龄数据**

In [43]:
df_student.loc[df_student['xh'].isin(student_2014['xh']),'age'] = age_2014
df_student.loc[df_student['xh'].isin(student_2015['xh']),'age'] = age_2015
df_student.loc[df_student['xh'].isin(student_2016['xh']),'age'] = age_2016
df_student.loc[df_student['xh'].isin(student_2017['xh']),'age'] = age_2017
df_student.loc[df_student['xh'].isin(student_2018['xh']),'age'] = age_2018

In [44]:
df_student.isnull().sum()

xh          0
xm          0
xb          0
mzm      1970
zzmmm    2519
age         1
dtype: int64

**学号为999999999的学生年龄并没有处理，可以根据入学年份处理**

**填补缺失民族码数据**

In [45]:
df_student.loc[df_student['xh'].isin(student_2014['xh']),'mzm'] = student_2014['mzm'].median()
df_student.loc[df_student['xh'].isin(student_2015['xh']),'mzm'] = student_2015['mzm'].median()
df_student.loc[df_student['xh'].isin(student_2016['xh']),'mzm'] = student_2016['mzm'].median()
df_student.loc[df_student['xh'].isin(student_2017['xh']),'mzm'] = student_2017['mzm'].median()
df_student.loc[df_student['xh'].isin(student_2018['xh']),'mzm'] = student_2018['mzm'].median()

**填补缺失政治面貌码数据**

In [46]:
df_student.loc[df_student['xh'].isin(student_2014['xh']),'zzmmm'] = student_2014['zzmmm'].median()
df_student.loc[df_student['xh'].isin(student_2015['xh']),'zzmmm'] = student_2015['zzmmm'].median()
df_student.loc[df_student['xh'].isin(student_2016['xh']),'zzmmm'] = student_2016['zzmmm'].median()
df_student.loc[df_student['xh'].isin(student_2017['xh']),'zzmmm'] = student_2017['zzmmm'].median()
df_student.loc[df_student['xh'].isin(student_2018['xh']),'zzmmm'] = student_2018['zzmmm'].median()

In [47]:
df_student.isnull().sum()

xh       0
xm       0
xb       0
mzm      1
zzmmm    1
age      1
dtype: int64

In [48]:
df_student.describe()

                 xh      mzm    zzmmm           age
count  3.248000e+04  32479.0  32479.0  32479.000000
mean   2.016610e+08      1.0      3.0     21.032144
std    4.432228e+06      0.0      0.0      1.413238
min    2.014000e+08      1.0      3.0     19.000000
25%    2.015150e+08      1.0      3.0     20.000000
50%    2.016321e+08      1.0      3.0     21.000000
75%    2.017541e+08      1.0      3.0     22.000000
max    1.000000e+09      1.0      3.0     23.000000

In [52]:
std_null =  df_student[df_student['mzm'].isnull()]
std_null

              xh  xm xb  mzm  zzmmm  age
31741  999999999  王*  男  NaN    NaN  NaN

In [53]:
df_student.drop(labels=std_null.index,inplace=True,axis=0)

In [54]:
df_student.isnull().sum()

xh       0
xm       0
xb       0
mzm      0
zzmmm    0
age      0
dtype: int64

In [55]:
df_student.to_csv('student.csv',encoding='utf-8',index=False)